app/controllers/admin/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def remove
    @client = Client.find(params[:id])
    @client.destroy
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 1]]