app/controllers/admin/incomes_controller.rb

  def index
                # do poprawki - przejscie z sqlite na postgres sprawilo ze to nie dziala
    @days = Visit.select("start_time,SUM(price) as price").group("start_time").where(:start_time => DateTime.now.beginning_of_month..DateTime.now.end_of_month).where(:status => true).order("start_time DESC").all
    @months = Visit.select("start_time,SUM(price) as price").group("start_time").where(:status => true).order("start_time DESC").all
    @years = Visit.select("start_time,SUM(price) as price").group("start_time").where(:status => true).order("start_time DESC").all
    @total = 0
    @years.collect { |x| @total = @total + x.price }
---
SELECT start_time,SUM(price) as price FROM "visits" WHERE "visits"."status" = $1 AND ("visits"."start_time" IS NOT NULL) GROUP BY "visits"."start_time", (DATE_TRUNC('week', ("visits"."start_time"::timestamptz - INTERVAL '6 day') AT TIME ZONE 'Etc/UTC') + INTERVAL '6 day') AT TIME ZONE 'Etc/UTC' ORDER BY start_time DESC  [["status", true]]
SELECT COUNT(start_time,SUM(price) as price) AS count_start_time_sum_price_as_price, "visits"."start_time" AS visits_start_time, (DATE_TRUNC('month', ("visits"."start_time"::timestamptz) AT TIME ZONE 'Etc/UTC')) AT TIME ZONE 'Etc/UTC' AS date_trunc_month_visits_start_time_timestamptz_at_time_zone_etc FROM "visits" WHERE "visits"."status" = $1 AND ("visits"."start_time" IS NOT NULL) GROUP BY "visits"."start_time", (DATE_TRUNC('month', ("visits"."start_time"::timestamptz) AT TIME ZONE 'Etc/UTC')) AT TIME ZONE 'Etc/UTC' ORDER BY start_time DESC  [["status", true]]
SELECT date_trunc( 'month', created_at ) as month,COUNT(*) AS count,SUM(price) as price FROM "visits" WHERE "visits"."status" = $1 GROUP BY month  [["status", "t"]]