app/controllers/admin/service_controller.rb

  def index
    @services = Service.all
---
SELECT "services".* FROM "services"

  def create
    @services = Service.new(params.require(:service).permit(:name, :description,:price, :duration))
    if @services.save
---
INSERT INTO "services" ("name", "description", "price", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "haha"], ["description", "1231"], ["price", 60], ["duration", 60], ["created_at", "2019-01-19 22:52:34.681121"], ["updated_at", "2019-01-19 22:52:34.681121"]]