app/controllers/admin/visits_controller.rb

SELECT "visits".* FROM "visits"
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "visits".* FROM "visits" WHERE "visits"."start_time" BETWEEN $1 AND $2 ORDER BY "visits"."start_time" ASC  [["start_time", "2019-01-01 00:00:00"], ["start_time", "2019-02-01 23:59:59.999999"]]
---
  def index

    allvisits = Visit.all

    @events = Array.new

    allvisits.each do |v|

      duration = 0

      v.service_visits.each do |s|
        duration += s.service.duration
      end

      @events.push(:title => v.client.first_name + ' ' + v.client.last_name, :start => v.start_time, :end => (v.start_time + duration.minutes), :backgroundColor => ((v.status) ? 'green' : '' ) )

SELECT  "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @visit = Visit.find(params[:id])

SELECT  "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "employees".* FROM "employees" INNER JOIN "employees_services" ON "employees"."id" = "employees_services"."employee_id" WHERE "employees_services"."service_id" = $1  [["service_id", 1]]
SELECT "services".* FROM "services"
---
  def edit
    @visit = Visit.find(params[:id])

    @se = Service.all.collect { |s| {:id => s.id, :name => s.name, :price => s.price, :duration => s.duration, :employees => s.employees.all.collect { |x| {:id => x.id, :name => x.last_name+' '+x.first_name} }} }

SELECT  "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "employees".* FROM "employees" INNER JOIN "employees_services" ON "employees"."id" = "employees_services"."employee_id" WHERE "employees_services"."service_id" = $1  [["service_id", 1]]
SELECT "services".* FROM "services"
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1  ORDER BY "employees"."id" ASC LIMIT 1  [["id", 5]]
SELECT SUM("services"."price") FROM "services" WHERE "services"."id" = 1
UPDATE "visits" SET "price" = $1, "start_time" = $2, "updated_at" = $3 WHERE "visits"."id" = $4  [["price", 60], ["start_time", "2019-01-24 12:15:00"], ["updated_at", "2019-01-24 09:07:04.947572"], ["id", 1]]
---
  def update

    @visit = Visit.find(params[:id])

    @se = Service.all.collect { |s| {:id => s.id, :name => s.name, :price => s.price, :duration => s.duration, :employees => s.employees.all.collect { |x| {:id => x.id, :name => x.last_name+' '+x.first_name} }} }
    @sejson = @se.to_json

    @services = ServiceVisit.select('*').joins(:service, :employee).where(:visit_id => params[:id]).all.collect { |s| {:employee => s.employee_id, :service => s.service_id, :name => s.name, :duration => s.duration, :price => s.price, :employee_name => s.last_name+' '+s.first_name} }
    @services = @services.to_json

    p = params.require(:visit)

    if p[:services]
      price = Service.where(:id => p[:services].collect { |s| s.split(',')[0] }).sum(:price)
      price = (price - (price * (p[:discount].to_i / 100.0))).to_i
    else
      price = 0
    end

    if @visit.update(
        :client_id => p[:client_id],
        :price => price,
        :discount => p[:discount],
        :comments => p[:comments],
        :status => p[:status],
        :start_time => p[:start_time],
        :sms => p[:sms],
        :email => p[:email]
    )

SELECT "employees".* FROM "employees" INNER JOIN "employees_services" ON "employees"."id" = "employees_services"."employee_id" WHERE "employees_services"."service_id" = $1  [["service_id", 1]]
SELECT "services".* FROM "services"
---
  def new

    @visit = Visit.new

    @se = Service.all.collect { |s| {:id => s.id, :name => s.name, :price => s.price, :duration => s.duration, :employees => s.employees.all.collect { |x| {:id => x.id, :name => x.last_name+' '+x.first_name} }} }

SELECT "employees".* FROM "employees" INNER JOIN "employees_services" ON "employees"."id" = "employees_services"."employee_id" WHERE "employees_services"."service_id" = $1  [["service_id", 1]]
SELECT "services".* FROM "services"
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1  ORDER BY "employees"."id" ASC LIMIT 1  [["id", 5]]
SELECT SUM("services"."price") FROM "services" WHERE "services"."id" = 1
INSERT INTO "visits" ("client_id", "price", "discount", "comments", "status", "start_time", "sms", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create

    @se = Service.all.collect { |s| {:id => s.id, :name => s.name, :price => s.price, :duration => s.duration, :employees => s.employees.all.collect { |x| {:id => x.id, :name => x.last_name+' '+x.first_name} }} }
    @sejson = @se.to_json

    p = params.require(:visit)

    if p[:services]
      price = Service.where(:id => p[:services].collect { |s| s.split(',')[0] }).sum(:price)
      price = (price - (price * (p[:discount].to_i / 100.0))).to_i
    else
      price = 0
    end


    @visit = Visit.new(
        :client_id => p[:client_id],
        :price => price,
        :discount => p[:discount],
        :comments => p[:comments],
        :status => p[:status],
        :start_time => p[:start_time],
        :sms => p[:sms],
        :email => p[:email]
    )

    if @visit.save

SELECT "visits"."id", "visits"."start_time", SUM("duration") as duration FROM "visits" LEFT JOIN "services_visits" ON "visits"."id"="services_visits"."visit_id" LEFT JOIN "services" ON "services"."id"="services_visits"."service_id" LEFT JOIN "employees" ON "employees"."id"="services_visits"."employee_id" WHERE "services_visits"."employee_id" = 5 GROUP BY "visits"."id"
SELECT * FROM "services_visits" INNER JOIN "services" ON "services"."id" = "services_visits"."service_id" INNER JOIN "employees" ON "employees"."id" = "services_visits"."employee_id" WHERE "services_visits"."visit_id" = $1  [["visit_id", 3]]
---
  def scheduler

    ids = params[:id].split(',').uniq

    @visits = Visit.select('"visits"."id", "visits"."start_time", SUM("duration") as duration').joins('LEFT JOIN "services_visits" ON "visits"."id"="services_visits"."visit_id"', 'LEFT JOIN "services" ON "services"."id"="services_visits"."service_id"', 'LEFT JOIN "employees" ON "employees"."id"="services_visits"."employee_id"').where('services_visits.employee_id' => ids).group('"visits"."id"')
    @visits = @visits.collect { |v| {:id => v.id, :start => v.start_time, :end => (v.start_time+ v.duration.minutes)} }