app/views/admin/index.html.erb

        <span class="info-box-text">Wizyt dziś</span>
        <span class="info-box-number"><%= Visit.where(:start_time => DateTime.now.beginning_of_day()..(DateTime.now.beginning_of_day() + 1.day)).count %></span>
---
SELECT COUNT(*) FROM "visits" WHERE "visits"."start_time" BETWEEN $1 AND $2  [["start_time", "2019-01-23 23:00:00"], ["start_time", "2019-01-24 23:00:00"]]

        <span class="info-box-text">Wizyt łącznie</span>
        <span class="info-box-number"><%= Visit.count %></span>
---
SELECT COUNT(*) FROM "visits"