app/views/admin/employees_services/index.html.erb

        <th>
          <% if e.services.blank? %>
---
SELECT "services".* FROM "services" INNER JOIN "employees_services" ON "services"."id" = "employees_services"."service_id" WHERE "employees_services"."employee_id" = $1  [["employee_id", 5]]