app/views/admin/visits/index.html.erb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 2]]
---
            <!-- todo link do pokazania klienta -->
            <td><%= v.client.first_name+' '+v.client.last_name %></td>