app/views/admin/visits/new.html.erb

      <%= f.label :client_id, "Klient" %>
      <%= select("visit", "client_id", Client.order('lower(last_name)', 'lower(first_name)').all.collect { |p| [p.last_name+ ' '+p.first_name, p.id] }, {include_blank: 'Wybierz klienta...'}, :class => 'form-control', :required => true) %>
---
SELECT "clients".* FROM "clients"  ORDER BY lower(last_name), lower(first_name)