app/views/admin/visits/show.html.erb

    <!-- todo link do klienta -->
    <td><%= @visit.client.first_name+' '+@visit.client.last_name %></td>
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 2]]

    <!-- tood link do pracownika -->
    <td><%= link_to s.employee.first_name+' '+s.employee.last_name, admin_employee_show_path(s.employee) %></td>
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1  ORDER BY "employees"."id" ASC LIMIT 1  [["id", 5]]