app/controllers/admin_controller.rb

  def cron

    visits = Visit.select('"visits".*,"clients"."email" as "mail","clients"."phone_number"').joins(:client).where('"visits"."sms" = "t" or "visits"."email" = "t"' ).where('"visits"."status" = "f"').all
---
SELECT "visits".*,"clients"."email" as "mail","clients"."phone_number" FROM "visits" INNER JOIN "clients" ON "clients"."id" = "visits"."client_id" WHERE ("visits"."sms" = "t" or "visits"."email" = "t") AND ("visits"."status" = "f")