app/controllers/clients_controller.rb

SELECT "visits".* FROM "visits" WHERE (client_id = 7 AND status = 't')
---
  def end_visits
    @visits = Visit.where("client_id = ? AND status = ?", current_client, "t")

SELECT "visits".* FROM "visits" WHERE (client_id = 1 AND status = 'f')
---
 def reserved_visits
   @visits = Visit.where("client_id = ? AND status = ?", current_client, "f")