app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"
---
  def index
    @Employee = Employee.all