app/controllers/visits_controller.rb

  def index

    allvisits = Visit.all
---
SELECT "visits".* FROM "visits"

  def new

    @visit = Visit.new

    @se = Service.all.collect { |s| {:id => s.id, :name => s.name, :price => s.price, :duration => s.duration, :employees => s.employees.all.collect { |x| {:id => x.id, :name => x.last_name+' '+x.first_name} }} }
---
SELECT "employees".* FROM "employees" INNER JOIN "employees_services" ON "employees"."id" = "employees_services"."employee_id" WHERE "employees_services"."service_id" = ?  [["service_id", 24]]
SELECT "services".* FROM "services"

  def create

    @se = Service.all.collect { |s| {:id => s.id, :name => s.name, :price => s.price, :duration => s.duration, :employees => s.employees.all.collect { |x| {:id => x.id, :name => x.last_name+' '+x.first_name} }} }
    @sejson = @se.to_json

    p = params.require(:visit)

    if p[:services]
      price = Service.where(:id => p[:services].collect { |s| s.split(',')[0] }).sum(:price)
      price = price.to_i
    else
      price = 0
    end


    @visit = Visit.new(
        :client_id => current_client.id,
        :price => price,
        :discount => 0,
        :comments => p[:comments],
        :status => false,
        :start_time => p[:start_time],
        :sms => p[:sms],
        :email => p[:email]
    )

    if @visit.save
---
SELECT "employees".* FROM "employees" INNER JOIN "employees_services" ON "employees"."id" = "employees_services"."employee_id" WHERE "employees_services"."service_id" = $1  [["service_id", 1]]
SELECT "services".* FROM "services"
SELECT SUM("services"."price") FROM "services" WHERE "services"."id" = 1
INSERT INTO "visits" ("client_id", "price", "discount", "comments", "start_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["client_id", 1], ["price", 0], ["discount", 0], ["comments", ""], ["start_time", "2019-02-06 12:30:00"], ["created_at", "2019-02-05 12:25:09.427785"], ["updated_at", "2019-02-05 12:25:09.427785"]]